<template>
  <div class="paginate-wrapper">
    <div class="pages"> Страницы:</div>
    <span class="to-first-page paginate-control" :class="{'disabled' : isFirstPage}" @click="onClickFirst">
    <svg width="10" height="11" viewBox="0 0 10 11" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path
        d="M0.162909 5.92922L4.70779 10.8243C4.8129 10.9376 4.95323 11 5.10285 11C5.25247 11 5.39279 10.9376 5.49791 10.8243L5.83261 10.4639C6.0504 10.229 6.0504 9.84733 5.83261 9.61285L2.01616 5.50228L5.83684 1.38715C5.94196 1.27384 6 1.1228 6 0.961732C6 0.800489 5.94196 0.649442 5.83684 0.536044L5.50215 0.17573C5.39695 0.0624217 5.25671 -6.49809e-08 5.10708 -7.80613e-08C4.95746 -9.11417e-08 4.81714 0.0624217 4.71202 0.17573L0.162909 5.07525C0.0575425 5.18892 -0.000330251 5.34068 2.08512e-06 5.50201C-0.00033029 5.66397 0.0575425 5.81564 0.162909 5.92922Z"
        fill="#E3F0FF"/>
    <path
        d="M4.16291 5.92922L8.70779 10.8243C8.8129 10.9376 8.95323 11 9.10285 11C9.25247 11 9.39279 10.9376 9.49791 10.8243L9.83261 10.4639C10.0504 10.229 10.0504 9.84733 9.83261 9.61285L6.01616 5.50228L9.83684 1.38715C9.94196 1.27384 10 1.1228 10 0.961732C10 0.800489 9.94196 0.649442 9.83684 0.536044L9.50215 0.17573C9.39695 0.0624217 9.25671 -6.49809e-08 9.10708 -7.80613e-08C8.95746 -9.11417e-08 8.81714 0.0624217 8.71202 0.17573L4.16291 5.07525C4.05754 5.18892 3.99967 5.34068 4 5.50201C3.99967 5.66397 4.05754 5.81564 4.16291 5.92922Z"
        fill="#E3F0FF"/>
  </svg>
  </span>
    <span class="prew-page paginate-control" :class="{'disabled' : isFirstPage}" @click="onclickPrev">
        <svg width="6" height="11" viewBox="0 0 6 11" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M0.162909 5.92922L4.70779 10.8243C4.8129 10.9376 4.95323 11 5.10285 11C5.25247 11 5.39279 10.9376 5.49791 10.8243L5.83261 10.4639C6.0504 10.229 6.0504 9.84733 5.83261 9.61285L2.01616 5.50228L5.83684 1.38715C5.94196 1.27384 6 1.1228 6 0.961732C6 0.800489 5.94196 0.649442 5.83684 0.536044L5.50215 0.17573C5.39695 0.0624217 5.25671 -6.49809e-08 5.10708 -7.80613e-08C4.95746 -9.11417e-08 4.81714 0.0624217 4.71202 0.17573L0.162909 5.07525C0.0575425 5.18892 -0.000330251 5.34068 2.08512e-06 5.50201C-0.00033029 5.66397 0.0575425 5.81564 0.162909 5.92922Z"
                fill="#E3F0FF"/>
        </svg>
        </span>
    <span class="paginate-info">
      <span class="currentPage">{{ currentPage }}</span> из {{ totalPage }}
    </span>
    <span class="next-page paginate-control" :class="{'disabled' : isLastPage}" @click="onClickNext">
      <svg width="6" height="11" viewBox="0 0 6 11" fill="none"
           xmlns="http://www.w3.org/2000/svg">
<path
    d="M5.83709 5.07078L1.29221 0.17573C1.1871 0.0624223 1.04677 0 0.897152 0C0.74753 0 0.607207 0.0624223 0.50209 0.17573L0.167391 0.536134C-0.0503999 0.770977 -0.0503999 1.15267 0.167391 1.38715L3.98384 5.49772L0.163156 9.61285C0.0580385 9.72616 -3.12529e-07 9.8772 -3.17625e-07 10.0383C-3.22727e-07 10.1995 0.0580385 10.3506 0.163156 10.464L0.497855 10.8243C0.603055 10.9376 0.743295 11 0.892917 11C1.04254 11 1.18286 10.9376 1.28798 10.8243L5.83709 5.92475C5.94246 5.81108 6.00033 5.65932 6 5.49799C6.00033 5.33603 5.94246 5.18436 5.83709 5.07078Z"
    fill="#5893D4"/>
</svg>
</span>
    <span class="to-last-page paginate-control" :class="{'disabled' : isLastPage}" @click="onClickLast">
      <svg width="10" height="11" viewBox="0 0 10 11" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path
          d="M5.83709 5.07078L1.29221 0.17573C1.1871 0.0624223 1.04677 0 0.897152 0C0.74753 0 0.607207 0.0624223 0.50209 0.17573L0.167391 0.536134C-0.0503999 0.770977 -0.0503999 1.15267 0.167391 1.38715L3.98384 5.49772L0.163156 9.61285C0.0580385 9.72616 -3.12529e-07 9.8772 -3.17625e-07 10.0383C-3.22727e-07 10.1995 0.0580385 10.3506 0.163156 10.464L0.497855 10.8243C0.603055 10.9376 0.743295 11 0.892917 11C1.04254 11 1.18286 10.9376 1.28798 10.8243L5.83709 5.92475C5.94246 5.81108 6.00033 5.65932 6 5.49799C6.00033 5.33603 5.94246 5.18436 5.83709 5.07078Z"
          fill="#9DCCFF"/>
      <path
          d="M9.83709 5.07078L5.29221 0.17573C5.1871 0.0624223 5.04677 0 4.89715 0C4.74753 0 4.60721 0.0624223 4.50209 0.17573L4.16739 0.536134C3.9496 0.770977 3.9496 1.15267 4.16739 1.38715L7.98384 5.49772L4.16316 9.61285C4.05804 9.72616 4 9.8772 4 10.0383C4 10.1995 4.05804 10.3506 4.16316 10.464L4.49785 10.8243C4.60306 10.9376 4.74329 11 4.89292 11C5.04254 11 5.18286 10.9376 5.28798 10.8243L9.83709 5.92475C9.94246 5.81108 10.0003 5.65932 10 5.49799C10.0003 5.33603 9.94246 5.18436 9.83709 5.07078Z"
          fill="#9DCCFF"/>
    </svg>
    </span>


  </div>
</template>

<script>
export default {
  name: "PaginateForTable",
  props: ['currentPage', 'totalPage'],
  computed : {
    isFirstPage () {
      return this.currentPage === 1
    },
    isLastPage () {
      return this.currentPage === this.totalPage
    }
  },
  methods: {
    onClickFirst() {
      this.$emit('click-first')
    },
    onclickPrev() {
      this.$emit('click-prev')
    },
    onClickNext() {
      this.$emit('click-next')
    },
    onClickLast() {
      this.$emit('click-last')
    }
  }
}
</script>

<style scoped lang="scss">
.currentPage {
  color: #5893D4;
}

.paginate-wrapper {
  min-width: 210px;
  margin-right: 25px;
  display: flex;
  font-size: 14px;
  line-height: 14px;
  /* identical to box height */
  .pages {
    margin-right: 15px;
  }

  .to-first-page {
    margin-right: 10px;
  }

  .prew-page {
    margin-right: 15px;
  }

  .paginate-info {
    margin-right: 15px;
  }

  .next-page {
    margin-right: 10px;
  }

  .paginate-control {
    cursor: pointer;
    &.disabled {
      opacity: 0.5;
      pointer-events: none;
    }

    svg {
      path {
        fill: #9DCCFF;
      }
    }

    &:hover {
      svg {
        path {
          fill: #5893D4;
        }
      }
    }
  }

  /* 5 */

  color: #9DCCFF;
}
</style>
